html/frontend/2-javascript.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-03-06 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JavaScript</title>
<meta name="author" content="1a2y" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">JavaScript</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge189331">1. Javascript</a>
<ul>
<li><a href="#org210d1c6">1.1. 模块和命名空间</a>
<ul>
<li><a href="#org34d1748">1.1.1. 最原始的解决方案 IIFE</a></li>
<li><a href="#org8fbb067">1.1.2. CommonJS</a></li>
<li><a href="#orgb240c13">1.1.3. AMD/UMD</a></li>
<li><a href="#org9ebf261">1.1.4. Modules in ES6</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8c15374">2. NodeJs</a></li>
</ul>
</div>
</nav>


<section id="outline-container-orge189331" class="outline-2">
<h2 id="orge189331"><span class="section-number-2">1.</span> Javascript</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org210d1c6" class="outline-3">
<h3 id="org210d1c6"><span class="section-number-3">1.1.</span> 模块和命名空间</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org34d1748" class="outline-4">
<h4 id="org34d1748"><span class="section-number-4">1.1.1.</span> 最原始的解决方案 IIFE</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
充分利用了函数内部定义的变量是局部变量的语言特性。
</p>

<div class="org-src-container">
<pre class="src src-js">!<span style="color: #531ab6;">function</span> <span style="color: #000000;">()</span> <span style="color: #000000;">{</span>
    <span style="color: #531ab6;">var</span> <span style="color: #005e8b;">name</span> = <span style="color: #3548cf;">"I am Tom"</span>;

    <span style="color: #531ab6;">var</span> <span style="color: #005e8b;">a</span> = 1;
    <span style="color: #531ab6;">var</span> <span style="color: #005e8b;">b</span> = 2;

    window.tomSayHello = <span style="color: #531ab6;">function</span><span style="color: #dd22dd;">()</span> <span style="color: #dd22dd;">{</span>
        console.log<span style="color: #008899;">(</span>name<span style="color: #008899;">)</span>;
    <span style="color: #dd22dd;">}</span>
<span style="color: #000000;">}()</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fbb067" class="outline-4">
<h4 id="org8fbb067"><span class="section-number-4">1.1.2.</span> CommonJS</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<a href="http://nodejs.cn/api/modules.html">http://nodejs.cn/api/modules.html</a>
</p>

<p>
在 CommonJS 中:
</p>
<ul class="org-ul">
<li>一个文件就是一个模块，使用 module 变量代表当前模块</li>
<li>模块中定义的变量、函数、类都是私有的，需要通过 module.exports 向外暴露</li>
</ul>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #595959;">// </span><span style="color: #595959;">&#23450;&#20041;&#27169;&#22359; (circle.js)</span>
<span style="color: #531ab6;">const</span> <span style="color: #005e8b;">PI</span> = 3.1415926;
exports.erea = <span style="color: #531ab6;">function</span> <span style="color: #000000;">(</span><span style="color: #005e8b;">r</span><span style="color: #000000;">)</span> <span style="color: #000000;">{</span> <span style="color: #531ab6;">return</span> PI * r * r; <span style="color: #000000;">}</span>

<span style="color: #595959;">// </span><span style="color: #595959;">&#20854;&#20182;&#25991;&#20214;&#20013;&#20351;&#29992;&#27169;&#22359;</span>
<span style="color: #531ab6;">let</span> <span style="color: #005e8b;">circle</span> = require<span style="color: #000000;">(</span><span style="color: #3548cf;">'circle'</span><span style="color: #000000;">)</span>;
circle.area<span style="color: #000000;">(</span>30<span style="color: #000000;">)</span>;
</pre>
</div>

<p>
NodeJS 就是 CommonJS 这种规范的具体实现。
</p>
</div>
</div>

<div id="outline-container-orgb240c13" class="outline-4">
<h4 id="orgb240c13"><span class="section-number-4">1.1.3.</span> AMD/UMD</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
主要增加了对模块的异步支持。
</p>
</div>
</div>

<div id="outline-container-org9ebf261" class="outline-4">
<h4 id="org9ebf261"><span class="section-number-4">1.1.4.</span> Modules in ES6</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
终于，在 ES6 中在语言层面上添加了模块的支持。它充分吸取了 CommonJS 等框架的优点:
</p>
<ul class="org-ul">
<li>语法简单，每个文件都是一个模块</li>
<li>支持异步模块的支持</li>
</ul>

<p>
主要就两个 API:
</p>
<ul class="org-ul">
<li>export {a, b}</li>
<li>import a from 'file';</li>
</ul>

<p>
定义模块:
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #595959;">// </span><span style="color: #595959;">&#23450;&#20041;</span>
<span style="color: #531ab6;">let</span> <span style="color: #005e8b;">sex</span> = <span style="color: #3548cf;">'boy'</span>;
<span style="color: #531ab6;">let</span> <span style="color: #005e8b;">echo</span> = <span style="color: #531ab6;">function</span> <span style="color: #000000;">(</span><span style="color: #005e8b;">x</span><span style="color: #000000;">)</span> <span style="color: #000000;">{</span> console.log<span style="color: #dd22dd;">(</span>x<span style="color: #dd22dd;">)</span>; <span style="color: #000000;">}</span>

<span style="color: #595959;">// </span><span style="color: #595959;">&#23548;&#20986;</span>
<span style="color: #531ab6;">export</span> <span style="color: #000000;">{</span> sex: sex, echo: echo <span style="color: #000000;">}</span>;
<span style="color: #531ab6;">export</span> <span style="color: #000000;">{</span> sex, echo <span style="color: #000000;">}</span>;

<span style="color: #595959;">// </span><span style="color: #595959;">&#23450;&#20041; + &#23548;&#20986;</span>
<span style="color: #531ab6;">export</span> <span style="color: #531ab6;">let</span> <span style="color: #005e8b;">name</span> = <span style="color: #3548cf;">"hello"</span>;
<span style="color: #531ab6;">export</span> <span style="color: #531ab6;">let</span> <span style="color: #005e8b;">xxx</span> = <span style="color: #531ab6;">function</span><span style="color: #000000;">()</span> <span style="color: #000000;">{</span> console.log<span style="color: #dd22dd;">(</span><span style="color: #3548cf;">"helowold"</span><span style="color: #dd22dd;">)</span>; <span style="color: #000000;">}</span>
</pre>
</div>

<p>
使用模块:
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #531ab6;">import</span> * as xxx from <span style="color: #3548cf;">'./file'</span>;
xxx.sex; xxx.echo;

<span style="color: #531ab6;">import</span> <span style="color: #000000;">{</span> sex, echo, name <span style="color: #000000;">}</span> from <span style="color: #3548cf;">'./file'</span>;
</pre>
</div>

<p>
默认:
</p>
<div class="org-src-container">
<pre class="src src-js"><span style="color: #595959;">// </span><span style="color: #595959;">&#27599;&#20010;&#25991;&#20214;&#20013;&#21482;&#33021;&#23548;&#20986;&#19968;&#20010;&#40664;&#35748;&#30340;&#21464;&#37327;</span>
<span style="color: #531ab6;">export</span> <span style="color: #531ab6;">default</span> <span style="color: #531ab6;">let</span> <span style="color: #005e8b;">x</span> = <span style="color: #000000;">()</span> =&gt; console.log<span style="color: #000000;">(</span><span style="color: #3548cf;">'&#25105;&#26159;&#21807;&#19968;&#30340;'</span><span style="color: #000000;">)</span>;

<span style="color: #595959;">// </span><span style="color: #595959;">&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#23548;&#20986;&#30340;&#26159;&#40664;&#35748;&#30340;&#21464;&#37327;</span>
<span style="color: #531ab6;">import</span> x from <span style="color: #3548cf;">'./file'</span>;
</pre>
</div>
</div>
</div>
</div>
</section>

<section id="outline-container-org8c15374" class="outline-2">
<h2 id="org8c15374"><span class="section-number-2">2.</span> NodeJs</h2>
<div class="outline-text-2" id="text-2">
<p>
skip
</p>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 1a2y</p>
<p class="date">Created: 2023-03-06</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
